# PANDAS

panel data

data manipulation and data analysis

single-dimensional -> Series

multi-dimensional -> Data Frame

In [1]:
import pandas as pd
import numpy as np

## Series

In [2]:
series1 = pd.Series([1, 2, 3])
series1

0    1
1    2
2    3
dtype: int64

In [3]:
type(series1)

pandas.core.series.Series

In [4]:
series2 = pd.Series([1, 2, 3], index=['x', 'y', 'z'])
series2

x    1
y    2
z    3
dtype: int64

In [5]:
# create a Series object from a Python dictionary
pd.Series({'a': 100, 'b': 200, 'c': 300})

a    100
b    200
c    300
dtype: int64

In [6]:
pd.Series({'a': 100, 'b': 200, 'c': 300}, index=['a', 'x', 'b', 'y', 'z'])

a    100.0
x      NaN
b    200.0
y      NaN
z      NaN
dtype: float64

In [7]:
pd.Series([1, 2, 3]) + pd.Series([10, 20, 30])

0    11
1    22
2    33
dtype: int64

In [8]:
pd.Series([100, 200, 300]) + 10

0    110
1    210
2    310
dtype: int64

In [9]:
pd.Series([100, 200, 300]) - 10

0     90
1    190
2    290
dtype: int64

In [10]:
pd.Series([100, 200, 300]) * 2

0    200
1    400
2    600
dtype: int64

In [11]:
pd.Series([100, 200, 300]) / 2

0     50.0
1    100.0
2    150.0
dtype: float64

In [12]:
pd.Series([np.nan, np.nan, np.nan])

0   NaN
1   NaN
2   NaN
dtype: float64

In [13]:
pd.Series({1: ['a', 'b'], 2: ['a', 'b']})

1    [a, b]
2    [a, b]
dtype: object

## Data Frame

In [14]:
pd.DataFrame({'Name': ['Valeria', 'Vivian', 'Violet'], 'Score': [100, 88, 92]})

      Name  Score
0  Valeria    100
1   Vivian     88
2   Violet     92

In [15]:
np.random.seed(0)
np.random.randn(2, 4)

array([[ 1.76405235,  0.40015721,  0.97873798,  2.2408932 ],
       [ 1.86755799, -0.97727788,  0.95008842, -0.15135721]])

In [16]:
np.random.seed(0)
df1 = pd.DataFrame(np.random.randn(2, 4), index = ['a', 'b'], columns = ['Score 1', 'Score 2', 'Score 3', 'Score 4'])
df1

    Score 1   Score 2   Score 3   Score 4
a  1.764052  0.400157  0.978738  2.240893
b  1.867558 -0.977278  0.950088 -0.151357

In [17]:
df1['Score 4']

a    2.240893
b   -0.151357
Name: Score 4, dtype: float64

In [18]:
df1[['Score 1', 'Score 2']]

    Score 1   Score 2
a  1.764052  0.400157
b  1.867558 -0.977278

In [19]:
df1['Total Score'] = df1['Score 1'] + df1['Score 2'] + df1['Score 3'] + df1['Score 4']
df1

    Score 1   Score 2   Score 3   Score 4  Total Score
a  1.764052  0.400157  0.978738  2.240893     5.383841
b  1.867558 -0.977278  0.950088 -0.151357     1.689011

In [20]:
df1 > 1

   Score 1  Score 2  Score 3  Score 4  Total Score
a     True    False    False     True         True
b     True    False    False    False         True

In [21]:
df2 = pd.DataFrame([[1, np.nan, 2], [np.nan, np.nan, 2.5], [3, 4, 5], [np.nan, 6, 7]])
df2

     0    1    2
0  1.0  NaN  2.0
1  NaN  NaN  2.5
2  3.0  4.0  5.0
3  NaN  6.0  7.0

### .dropna(), fillna(value=)

In [22]:
df2.dropna(axis=0)

     0    1    2
2  3.0  4.0  5.0

In [23]:
df2.dropna(axis=1)

     2
0  2.0
1  2.5
2  5.0
3  7.0

In [24]:
df2.dropna(thresh=2, axis=0)

     0    1    2
0  1.0  NaN  2.0
2  3.0  4.0  5.0
3  NaN  6.0  7.0

In [25]:
df2.fillna(value=0)

     0    1    2
0  1.0  0.0  2.0
1  0.0  0.0  2.5
2  3.0  4.0  5.0
3  0.0  6.0  7.0

In [26]:
df3 = pd.DataFrame({'Age': [18, 19, 18], 'Name': ['Valeria', 'Vivian', 'Violet'], 'Score': [100,  88, 92]})
df3

   Age     Name  Score
0   18  Valeria    100
1   19   Vivian     88
2   18   Violet     92

### .groupby(), .count(), .describe(), .info()

In [27]:
df3.groupby('Age').count()

     Name  Score
Age
18      2      2
19      1      1

In [28]:
df3.groupby('Age').describe()

    Score
    count  mean       std   min   25%   50%   75%    max
Age
18    2.0  96.0  5.656854  92.0  94.0  96.0  98.0  100.0
19    1.0  88.0       NaN  88.0  88.0  88.0  88.0   88.0

In [29]:
df3.describe()

             Age       Score
count   3.000000    3.000000
mean   18.333333   93.333333
std     0.577350    6.110101
min    18.000000   88.000000
25%    18.000000   90.000000
50%    18.000000   92.000000
75%    18.500000   96.000000
max    19.000000  100.000000

In [30]:
df3.describe(include='all')

              Age     Name       Score
count    3.000000        3    3.000000
unique        NaN        3         NaN
top           NaN  Valeria         NaN
freq          NaN        1         NaN
mean    18.333333      NaN   93.333333
std      0.577350      NaN    6.110101
min     18.000000      NaN   88.000000
25%     18.000000      NaN   90.000000
50%     18.000000      NaN   92.000000
75%     18.500000      NaN   96.000000
max     19.000000      NaN  100.000000

In [31]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     3 non-null      int64
 1   Name    3 non-null      object
 2   Score   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

### .concat()

In [32]:
pd.concat([pd.DataFrame([[1, 1.5, 2]]),pd.DataFrame([[3, 3.5, 4]])])

   0    1  2
0  1  1.5  2
0  3  3.5  4

In [33]:
pd.concat([pd.DataFrame([[1, 1.5, 2]]),pd.DataFrame([[3, 3.5, 4]])], axis=1)

   0    1  2  0    1  2
0  1  1.5  2  3  3.5  4

### .set_index()

In [34]:
df3['StudentID'] = pd.Series([333, 334, 335])
df3.set_index(['StudentID'])

           Age     Name  Score
StudentID
333         18  Valeria    100
334         19   Vivian     88
335         18   Violet     92

### head(), tail(), shape, describe()

In [35]:
iris = pd.read_csv('iris.csv')

In [36]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [37]:
iris.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [38]:
iris.shape

(150, 5)

In [39]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

### .iloc() -> integer-based indexing
### .loc() -> label-based indexing

In [40]:
iris.iloc[0:8, 0:4]

   sepal.length  sepal.width  petal.length  petal.width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           4.6          3.4           1.4          0.3
7           5.0          3.4           1.5          0.2

In [41]:
iris.loc[0:4, ('sepal.length', 'petal.length')]

   sepal.length  petal.length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5
4           5.0           1.4

### .drop()

In [42]:
iris= iris.drop('variety', axis=1) # axis=1 means column

In [43]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [44]:
iris = iris.drop([0, 1, 2], axis=0)

In [45]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4
6           4.6          3.4           1.4          0.3
7           5.0          3.4           1.5          0.2

### mean(), median(), min(), max()

In [46]:
iris.mean()

sepal.length    5.862585
sepal.width     3.053741
petal.length    3.806803
petal.width     1.219728
dtype: float64

In [47]:
iris.median()

sepal.length    5.8
sepal.width     3.0
petal.length    4.4
petal.width     1.3
dtype: float64

In [48]:
iris.min()

sepal.length    4.3
sepal.width     2.0
petal.length    1.0
petal.width     0.1
dtype: float64

In [49]:
iris.max()

sepal.length    7.9
sepal.width     4.4
petal.length    6.9
petal.width     2.5
dtype: float64

### apply()

In [50]:
def half(a): return a*0.5
iris['sepal.length'].apply(half)

3      2.30
4      2.50
5      2.70
6      2.30
7      2.50
       ...
145    3.35
146    3.15
147    3.25
148    3.10
149    2.95
Name: sepal.length, Length: 147, dtype: float64

### .value_counts(), .sort_values()

In [51]:
iris = pd.read_csv('iris.csv')
iris['variety'].value_counts()

variety
Setosa        50
Versicolor    50
Virginica     50
Name: count, dtype: int64

In [52]:
iris.sort_values(by='sepal.length')

     sepal.length  sepal.width  petal.length  petal.width    variety
13            4.3          3.0           1.1          0.1     Setosa
42            4.4          3.2           1.3          0.2     Setosa
38            4.4          3.0           1.3          0.2     Setosa
8             4.4          2.9           1.4          0.2     Setosa
41            4.5          2.3           1.3          0.3     Setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  Virginica
118           7.7          2.6           6.9          2.3  Virginica
117           7.7          3.8           6.7          2.2  Virginica
135           7.7          3.0           6.1          2.3  Virginica
131           7.9          3.8           6.4          2.0  Virginica

[150 rows x 5 columns]

### .groupby()

In [53]:
iris.groupby('variety').describe()

           sepal.length                                              \
                  count   mean       std  min    25%  50%  75%  max
variety
Setosa             50.0  5.006  0.352490  4.3  4.800  5.0  5.2  5.8
Versicolor         50.0  5.936  0.516171  4.9  5.600  5.9  6.3  7.0
Virginica          50.0  6.588  0.635880  4.9  6.225  6.5  6.9  7.9

           sepal.width         ... petal.length      petal.width         \
                 count   mean  ...          75%  max       count   mean
variety                        ...
Setosa            50.0  3.428  ...        1.575  1.9        50.0  0.246
Versicolor        50.0  2.770  ...        4.600  5.1        50.0  1.326
Virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
variety
Setosa      0.105386  0.1  0.2  0.2  0.3  0.6
Versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
Virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

### .merge()

In [54]:
table1 = pd.DataFrame({'StudentID': [1, 2, 3], 'Name': ['Valeria', 'Vivian', 'Violet'], 'Score1': [100, 88, 92]})
table2 = pd.DataFrame({'StudentID': [1, 2, 3, 4], 'Name': ['Valeria', 'Vivian', 'Violet', 'Veronica'], 'Score2': [55, 43, 68, 100]})
pd.merge(table1, table2, how='outer', on='StudentID')

   StudentID   Name_x  Score1    Name_y  Score2
0          1  Valeria   100.0   Valeria      55
1          2   Vivian    88.0    Vivian      43
2          3   Violet    92.0    Violet      68
3          4      NaN     NaN  Veronica     100

In [55]:
pd.merge(table1, table2, how='inner', on='StudentID')

   StudentID   Name_x  Score1   Name_y  Score2
0          1  Valeria     100  Valeria      55
1          2   Vivian      88   Vivian      43
2          3   Violet      92   Violet      68